# BentFabricSheetClosedLoopInSketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..BentFabricSheetClosedLoopInSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
The bend profile cannot contain a closed loop. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BentFabricSheetClosedLoopInSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BentFabricSheetClosedLoopInSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BentFabricSheetClosedLoopInSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace